railwebsite/app/controllers/databases_controller.rb

SELECT "databases".* FROM "databases"
---
  def index
    @databases = Database.all

INSERT INTO "databases" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["first_name", ""], ["last_name", ""], ["email", ""], ["phone", ""], ["twitter", ""], ["created_at", "2024-05-04 03:00:12.026272"], ["updated_at", "2024-05-04 03:00:12.026272"]]
---
  def create
    @database = Database.new(database_params)

    respond_to do |format|
      if @database.save

SELECT "databases".* FROM "databases" WHERE "databases"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_database
      @database = Database.find(params[:id])